<template>
    <div class="viewer-container">

        <!-- 소설 커버 이미지 -->
        <img class="novel-cover" src="https://comicthumb-phinf.pstatic.net/20190325_108/pocket_1553525187132gW0BF_JPEG/untitled.jpg"/>

        <!-- 소설 제목 -->
        <h2 class="novel-title">1. 국민망겜 최종장 업데이트</h2>


        <!-- 윗쪽 버튼 -->
        <div class="button-container">
            <div class="previous">
                이전화
            </div>
            <div class="home">
            </div>
            <div class="next">
                다음화
            </div>
        </div>

        <!-- 소설 본문 -->
        <div class="novel-content">
            <div class="novel-text">
역사학자. 혹은 인류학자들은 지난 2000년간 무슨 일이 벌어졌는지 전혀 알 수 없었다. 지난 2000년의 기록이 아예 없다. 그나마 기록이 남아 있는 것은 최근 200년 가량. 기록이 사라져버린 그 시기를 '잃어버린 문명.' 이라고 부른다. 다만 추정하기로, 현재의 기술 수준은 과거 2010년대 후반 수준으로 판명되었다.

그래서 사람들은 편의상 '잃어버린 문명'을 제외하고서 지금을 DC 2016년이라고 표기하고 있다.

'잃어버린 문명' 자체를 부정하는 사람은 없었다. 증거가 뚜렷하게 남아있었으니까. 그 증거는 바로 시스템 '제우스'였다. 이 제우스를 누가 어디서 어떻게 만들었는지는 밝혀지지 않았다. 다만 이 '제우스'는 서울 여의도에 위치한 커다란 돔 안에 있다고 알려져 있다. 과거, 한국의 국회의사당이 있던 그 자리다. 그 자리는 커다란 돔에 둘러싸여 있으며 그 누구의 발길도 허락하지 않는다고 알려져 있다.

저 돔이 어떤 물질로 구성되어 있는지, 어떻게 하면 저 돔 안으로 들어갈 수 있는지도 모른다. 내부가 어떻게 생겼는지도 알 수 없다. 다만, 제우스는 실재하고 있는 '잃어버린 문명의 잔재'이며 그 잔재는 기록이 다시 시작된 지난 200년 동안, 가상현실게임 올림푸스를 운영하고 있다.

가상현실게임 올림푸스는 단순히 게임이 아니었다. DC 2016년 현대 문명의 주춧돌이 바로 올림푸스라고 해도 과언이 아니었으니까.

올림푸스에서는 석유도 구할 수 있다. 더 정확히 말하자면 석유의 역할을 대신하는 '몬스터 스톤'이지만, 어쨌거나 그걸 구해서 현실로 전송할 수 있다. 올림푸스의 물건을 현실로. 인류는 이를 통해 발전해왔고 이걸 올림푸스 혁명이라 부른다.

올림푸스는 현실을 유지하는 하나의 수단이었으며 올림푸스를 지배하는 자가 곧 현실을 지배하는 자가 되었다. 올림푸스의 산물이 이 현대사회를 이끌어갔으니까.

그래서 모든 사람들이 올림푸스를 지배하고 싶어했다.

'니미럴.'

한주혁도 그 중 한 명이었다. 불과 10년 전까지는.

'저 미친 스승새끼...!'

한주혁의 현재나이 26세. 올림푸스에서 첫 걸음을 내딛는 시기가 보통 6살이다. 통상적으로 6살부터 올림푸스에 진입하게 되며 아카데미에 입학하게 된다.

6살 때. 한주혁은 어느 미친놈에게 납치를 당했다. 그 미친놈이 이렇게 말했었다.

- 드디어 재능을 가진 아이를 찾았구나. 이런 재능을 가진 아이를 찾다니. 클클클! 천하의 무골이로고! 내 너를 세상에서 가장 강한 사내로 만들어 주겠다!

그렇게 20년이 흘러버렸다.

"이제 나는 죽어도 여한이 없구나. 내 모든 것을 전수했으니."

제발 어서 죽어주세요. 한주혁은 이 미친 작자에게 일말의 동정심도 품지 않았다. 정(情)도 느껴지지 않았다. 지금 집안에서 밥버러지, 만년 취준생 취급을 받고 있는 게 바로 이 미친 스승놈때문 아니겠는가.

20년간 납치 및 감금, 폭행, 협박, 괴롭힘을 받으며 이 늙은이를 위해 무료봉사를 해왔다. 자신을 납치하여 20년간 괴롭힌 당사자에게 무슨 미련이 남으랴. 몇 번이나 탈출을 시도했다가 정말 죽기 일보직전까지 얻어맞았다. 살아있는 상태로 하이에나들에게 뜯겨먹기도 했다. 그 때만 떠올리면 아직도 소름이 돋는다. 그 기억들이 아직도 생생했다.

'그래도 나는 결국 버텼어.'

어떻게 버텼는지. 자신이 왜 버텼는지. 그것도 잘 모르겠다. 일반적인 경우라면, 캐릭터 삭제를 하고 다시 키웠을 거다. 그게 당연한 거고 상식이다. 이런 경우를 일컬어 똥통에 빠졌다고 표현하니까. 그런데 한주혁은 그 똥통에서 어찌어찌 살아남았다.

"스승님."

그런데 아직 남은 게 좀 있다.

"저는 스승님의 아들 같은 존재입니다."

이 더러운 스승에게서 살아남기 위하여 아부 정도는 패시브 스킬이다. 그는 20년간 이렇게 버텼다.

"이 아들은 스승님의 비호 없이 험난한 세상을 살아갈 자신이 없습니다."

"...그렇지 않다. 나보단 많이 약하지만 그래도 많이 강해졌다."

그래서 말했다.

"부디 좀 더 가르침을 주십시오."

어차피 가르침을 줄 수 없다. 이제 이 납치, 폭행, 감금을 자행한 범죄자는 죽는다. 그건 누구보다도 한주혁 자신이 알고 있다. 그가 원하는 건 혹시 모를 추가 퀘스트나 보상.

"내 너의 마음을 잘 알았다. 잊지 말거라. 너는 나의 하나뿐인 제자이며, 나의 진전을 이은 유일한 전승자라는 것을."

네. 그 빌어먹을 전승자라는 이유 때문에 20년간 감금을 당했지요. 납치범이 지도를 건넸다.

"이 곳을 찾아가거라. 이 곳에 너의 미래가 있을 것이니."

"가, 감사합니다. 스승님의 은혜. 하늘보다 높고 바다보다 깊을 것입니다."

한주혁은 절을 올렸다. 까짓 거. 20년을 했는데 한 번을 더 못하랴. 노인은 클클클 웃었다.

"클클클!"

그는 진정으로 기뻐했다.

"이 세상이 네 앞에서 무릎을 꿇을 것이다!"

한주혁이 절을 마치고 일어섰을 때, 그는 이미 죽어 있었다. 절대 밖으로 빠져나가지 못하도록 만들어 놓은 이상한 결계도 사라졌다.

알림이 들려왔다.

- '속박의 저주'가 해제 됩니다.
- '전승자의 의무'로 부터 자유로워 집니다.
- 특수 결계가 해제 됩니다.
- 스페셜 지역 '라이나'로부터 해방 됩니다.

'드디어...!'

드디어 자유다. 이제는 내 밥벌이를 할 수 있다. 집안에서 밥만 축내는, 아무 능력 없는 밥돌이가 되지 않아도 된다. 만년 취준생의 서러움. 이제는 끝이다! 기쁨의 눈물까지 흘러나왔다. 20년 만에 진짜 해방이 되었으니까.

'레벨 확인.'

레벨을 확인했다.

- LV: 99

이게 어느 정도인지, 제대로 감은 안 온다. 보통 잘 나간다는 사람들의 레벨이 보통 60정도 된다고만 알고 있다. 정말 유명한, 세계에서도 그 수위를 다투는 최상급 랭커의 경우 80대 후반 정도.

그런데 황당하게도 99다. 그는 남들과는 조금 다른 방식으로 레벨업을 했다. 그 힘들다는 스탯업 구간도 거치지 않았다. 그 스스로도 믿기 어렵다. 레벨이 99라니. 이런 거. 들어보지도 못했다. 20년 동안 캐릭삭제를 하지 않았던 것에 대한 보상이 이제야 주어지나 싶었다.

지난 20년의 악몽을 뒤로 한 채. 그는 스페셜 지역 라이나를 벗어나기 시작했다.

***

한주혁. 그는 이 시대의 패배자였다.

"엄마 친구 아들은 대연합에 들어갔더라."

"엄마 친구 아들은 이번에 중소연합에 들어갔는데 월급이 250만원 정도 되나봐. 그래도 복지도 괜찮고 야근도 없는 편이라 만족하는 편이라네?"

친척들이 모였다하면,

"주혁이 넌 언제 취직할거니?"

"그... 아직도 무슨 수련이니 뭐니하면서 삽질하고 있는 거야?"

"그러게 진작에 캐릭 삭제하고 시작했어야지. 지금 나이면 그냥 버리기에도 너무 늦지 않았나?"

한숨을 쉬며 그를 지적했다.

실생활에 필요한 대부분의 물품과 현시대를 이끌어가는 과학기술 문명의 근간이 바로 올림푸스에서 채굴되는 아이템 혹은 물건들이다. 그 아이템과 물건들을 얻는 곳이 바로 올림푸스 내의 회사. 다시 말해 '연합'인 셈이다.

"차라리 빨리 지우고 다시 키워서 중소연합이라도 들어가는 게 어때? 눈높이를 낮추는 것도 필요하다, 주혁아."

탄탄한 인프라와 높은 연봉, 괜찮은 복지, 많은 스텝업 퀘스트, 플레이어에 대한 투자가 활성화가 되어 있는 곳. 큰 규모와 자본을 갖춘 대연합. 그보다 상황이 훨씬 열악하고 규모가 작은 곳이 중소연합. 현재 청년들의 대부분이 이 중소연합에 속해있다고 보면 됐다. 보통의 경우, 이 대연합에 들어가게 되면 대단하다 칭찬받는다. 대연합의 경우는 초봉이 5천만원 정도는 되니까.

"그래. 차라리 검정고시 퀘스트 해서 20레벨까지 퍼뜩 올리고 작업공장에 진출이라도 하면 월 200씩은 꼬박꼬박 번다더라."

"......."

한주혁은 친척들이 모이는 자리를 싫어했다. 모두들 그를 패배자 혹은 문제아 취급했다.

6살에 올림푸스에 입문하여 아카데미를 가던 와중에 납치를 당했고, 20년간 특별한 결계 밖으로 빠져나가본 적이 없었으니까.

약 10년 전. 한창 꿈에 부풀었을 무렵. 그는 이렇게 유세를 부렸었다.

            </div>
        </div>

        <!-- 아래쪽 버튼 -->
        <div class="button-container">
            <div class="previous">
                이전화
            </div>
            <div class="home">
            </div>
            <div class="next">
                다음화
            </div>
        </div>

    </div>
</template>

<script>
export default {
    data() {
        return {
            tab: null,
            items: [
                { tab: '전체', content: 'Tab 1 Content' },
                { tab: '판타지', content: 'Tab 2 Content' },
                { tab: '무협', content: 'Tab 3 Content' },
                { tab: '로맨스', content: 'Tab 4 Content' },
                { tab: '현판', content: 'Tab 5 Content' },
            ],
        }
    },
    methods: {
        preventCopy: function(){
        //     document.addEventListener("contextmenu", function (e) {
        //        e.preventDefault();
        //    }, false);

        //    document.addEventListener("keydown", function (e) {
        //        //document.onkeydown = function(e) {
        //        // "I" key
        //        if (e.ctrlKey && e.shiftKey && e.keyCode == 73) {
        //            disabledEvent(e);
        //        }
        //        // "J" key
        //        if (e.ctrlKey && e.shiftKey && e.keyCode == 74) {
        //            disabledEvent(e);
        //        }
        //        // "S" key + macOS
        //        if (e.keyCode == 83 && (navigator.platform.match("Mac") ? e.metaKey : e.ctrlKey)) {
        //            disabledEvent(e);
        //        }
        //        // "U" key
        //        if (e.ctrlKey && e.keyCode == 85) {
        //            disabledEvent(e);
        //        }
        //        // "F12" key
        //        if (event.keyCode == 123) {
        //            disabledEvent(e);
        //        }
        //    }, false);
        //    function disabledEvent(e) {
        //        if (e.stopPropagation) {
        //            e.stopPropagation();
        //        } else if (window.event) {
        //            window.event.cancelBubble = true;
        //        }
        //        e.preventDefault();
        //        return false;
        //    }
        }
    },
    mounted(){
        this.preventCopy();
    }
}
</script>

<style scoped>
.viewer-container {
    margin: 20px auto 0px auto;
    max-width: 700px;
    width: 100%;
}

.novel-cover {
    width: 100%;
}

.button-container {
    display:flex;
}

.previous{
    background-color: #BFBFBF;
    width: 45%;
    height: 50px;
    max-width: 300px;
    max-height: 50px;
    font-size: 1rem;
    text-align: center;
    color: white;
}

.home {
    background-color: rgba(255,83,83,1);
    width: 50px;
    height: 50px;
    margin-left: 2%;
    margin-right: 2%;
}

.next {
    background-color: rgba(255,83,83,1);
    width: 45%;
    height: 50px;
    max-width: 300px;
    max-height: 50px;
    font-size: 1rem;
    text-align: center;
    color: white;
}
.novel-content {
    margin-top: 20px;
    margin-bottom: 20px;
    height: 100%;
}
.novel-text {
    width: 100%;
    height: 100%;
}

.novel-title {
    margin-top: 20px;
    margin-bottom: 20px;
}
</style>